# apply

In [3]:
import pandas as pd
import numpy as np

In [20]:
df = pd.DataFrame({
    'gruplar' : ['A', 'B', 'C', 'A', 'B', 'C'],
    'degisken1' : [10, 23, 33, 22, 11, 99],
    'degisken2' : [100, 253, 333, 262, 111, 969]
})
df

  gruplar  degisken1  degisken2
0       A         10        100
1       B         23        253
2       C         33        333
3       A         22        262
4       B         11        111
5       C         99        969

In [22]:
df.drop('gruplar', axis=1, inplace=True)
df

   degisken1  degisken2
0         10        100
1         23        253
2         33        333
3         22        262
4         11        111
5         99        969

In [25]:
df.apply(np.sum)

degisken1     198
degisken2    2028
dtype: int64

In [28]:
df.apply(np.mean)

degisken1     33.0
degisken2    338.0
dtype: float64

In [29]:
df = pd.DataFrame({
    'gruplar' : ['A', 'B', 'C', 'A', 'B', 'C'],
    'degisken1' : [10, 23, 33, 22, 11, 99],
    'degisken2' : [100, 253, 333, 262, 111, 969]
})
df

  gruplar  degisken1  degisken2
0       A         10        100
1       B         23        253
2       C         33        333
3       A         22        262
4       B         11        111
5       C         99        969

In [36]:
df.groupby('gruplar').apply(np.sum)

        gruplar  degisken1  degisken2
gruplar
A            AA         32        362
B            BB         34        364
C            CC        132       1302